# 主题列表，10个
theme = ["", "01校园突发事件", "02高考改革", "03校外培训机构治理", "04高校社团管理", "05中小学教师减负", "06教师队伍建设", "07高校思政课", "08高校院系党建", "09民办学校", "10学生会治理"]

# 主题标识码（hash码），与theme对应
sub_list = ['','2e72eda6b89c42e4a58371ee0c4f2f18','4735bda9fbcb40ddb327d208a949154f','6fb2396ab43e4ef782fe2a8458dc307a','a9944010d1c745418cb866e58d657386','4d154e467999433c8e92065cb673841b',
            '4214cf2e5edb4d4b8e336a39c0f07bb7','933fd377331b43f794909c258f4fafe1','62a26e1f3cdf4fec980c5270ea2f8905','00e3b456f473481c860a2f492e1f0738','cee6982bb5ed45df86be40cb4d01b69e']

# 关键词列表，根据主题演化
keywords = [[],
            ["高校突发","校园暴力", "校园突发"],
            ["高考改革", "新高考"],
            ["校外培训", "编程热", "素质教育", "线上培训", "培训机构", "补课"],
            ["高校社团", "学生社团", "社团管理","社团治理"],
            ["教育减负", "教师减负","学生减负","学校减负"],
            ["教师队伍","师德", "教师待遇","教师形象", "教师教育","新时代教师"],
            ["高校思政课","思政课建设" ,"新思政课","思政课大练兵"],
            ["高校党建", "院系党建"],
            ["民办学校","公办学校","生源挤压"],
            ["学生会治理","学生官僚主义","学生贵族","校研会"]
            ]

# 网站列表，19个
all_webname = ['选择所有网站', '人民网', '教育部政府门户网站', '新华网', '中国政府网',  '光明网', '央视网', '南方都市报', '新京报', '南方周末', '澎湃新闻网',
               '东方网', '财经网', '经济观察网', '财新网', '求是网', '中国青年报', '瞭望东方', '半月谈', '参考消息']

all_urls = ['',
    'www.people.com.cn',    #01 人民网
    'www.moe.gov.cn',
    'www.xinhuanet.com',
    'www.gov.cn',
    'www.gmw.cn',       #05 光明网
    'www.cctv.com',
    'www.southcn.com',
    'www.bjnews.com.cn',
    'www.infzm.com',
    'www.thepaper.cn',     #10 澎湃新闻网
    'www.eastday.com',
    'www.caijing.com.cn',
    'www.eeo.com.cn',
    'www.caixin.com',
    'www.qstheory.cn',      #15 求是网
    'www.cyol.net',
    'www.lwdf.cn',
    'www.banyuetan.org',
    'www.cankaoxiaoxi.com'  #19 参考消息
]

# # 主题列表，10个
# theme = ["", "01校园突发事件", "02高考改革", "03校外培训机构治理", "04高校社团管理", "05中小学教师减负", "06教师队伍建设", "07高校思政课", "08高校院系党建", "09民办学校", "10学生会治理"]
#
# # 主题标识码（hash码），与theme对应
# sub_list = ['','2e72eda6b89c42e4a58371ee0c4f2f18','4735bda9fbcb40ddb327d208a949154f','6fb2396ab43e4ef782fe2a8458dc307a','a9944010d1c745418cb866e58d657386','4d154e467999433c8e92065cb673841b',
#             '4214cf2e5edb4d4b8e336a39c0f07bb7','933fd377331b43f794909c258f4fafe1','62a26e1f3cdf4fec980c5270ea2f8905','00e3b456f473481c860a2f492e1f0738','cee6982bb5ed45df86be40cb4d01b69e']
#
# # 关键词列表，根据主题演化
# keywords = [[],
#             ["高考改革", "新高考"],
#             ["校外培训"],
#             ["高校社团"],
#             ["教育减负"],
#             ]
#
# # 网站列表，19个
# all_webname = ['选择所有网站', '人民网', '教育部政府门户网站']
#
# all_urls = ['',
#     'www.people.com.cn',    #01 人民网
#     'www.moe.gov.cn'
# ]